app/views/posts/show.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]
---
  %h2
    = @post.comments.count