app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "jefhakefha"], ["post_id", 6], ["user_id", 1], ["created_at", "2020-03-26 21:56:37.541013"], ["updated_at", "2020-03-26 21:56:37.541013"]]
---
def create
	@post = Post.find(params[:post_id])
	@comment = @post.comments.create(params[:comment].permit(:comment))
	@comment.user_id = current_user.id if current_user
	@comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 6], ["id", 1], ["LIMIT", 1]]
---
def edit
	@post = Post.find(params[:post_id])
	@comment = @post.comments.find(params[:id])