app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Mehnat Rang Laayi"], ["content", ":-)"], ["created_at", "2020-03-26 22:37:54.123384"], ["updated_at", "2020-03-26 22:37:54.123384"], ["user_id", 1]]
---
	def create
		@post = current_user.posts.build(post_params)
		if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "yes"], ["updated_at", "2020-03-26 15:53:58.670731"], ["id", 3]]
---
	def update
		if @post.update(post_params)